import { Injectable } from '@angular/core';
import { Observable, of } from 'rxjs';

@Injectable({
  providedIn: 'root'
})


export class YouAllServicesService {

  private mainObject: any[] = [
    {
      id: 1,
      pageData: {
        breadCrumb: [
          { id: 0, name: 'الرئيسية ', routing: '/home' },
          { id: 1, name: 'خدماتنا ', routing: '/our-services' },
          { id: 2, name: 'تصميم المواقع' }
        ],
        title: 'نصمّم مواقع تسبق توقعاتك',
        desc: 'مواقع سريعة، عصرية، وفعالة... مصممة لتُبرز علامتك وتحقّق أهدافك'
      },
      firstSection: {
        title: 'تصميم إبداعي يحوّل الأفكار إلى واقع',
        desc: 'من الهوية البصرية إلى تجربة المستخدم… نقدم حلول تصميم تعكس احترافك وتُبرز علامتك بأعلى جودة',
        img: 'assets/images/our-design.svg'
      },
      secondSection: {
        title: 'لماذا تصميم مواقعنا يستحق ثقتك؟',
        data: [
          { title: 'تصميم مخصص لهويتك', desc: 'نبتكر واجهات تعكس شخصية علامتك بدقة وتترك انطباعًا لا يُنسى.' },
          { title: 'تجربة مستخدم ذكية', desc: 'نصمم بتجربة مدروسة تجعل التصفح سهلًا وسلسًا لعملائك' },
          { title: 'أداء عالي وسرعة استجابة', desc: 'مواقع سريعة وآمنة تعمل بكفاءة على كل الأجهزة والمتصفحات' },
          { title: 'دعم واستمرارية', desc: 'نرافقك بعد التسليم لضمان استقرار موقعك وتطوره المستمر' }
        ]
      },
      thirdSection: {
        img: 'assets/images/you-frame.svg',
        title: 'YOU هو خيارك الأمثل لتصميم المواقع ',
        data: [
          { title: 'فريق بخبرة عالية', desc: 'نضم نخبة من مصممي الويب والمطورين الذين يجمعون بين الإبداع والمعرفة التقنية لإنشاء مواقع تعكس رؤية علامتك وتحقق أهدافك' },
          { title: 'مواقع تفاعلية وعصرية', desc: 'نصمم مواقع مرنة وسهلة التحديث باستخدام أحدث التقنيات لضمان سرعة الأداء وتجربة مستخدم متميزة' },
          { title: 'تكامل سلس مع المنصات', desc: 'نربط موقعك باحترافية بمنصات التواصل الاجتماعي والأدوات التسويقية لتوسيع انتشارك وزيادة التفاعل' },
          { title: 'مصداقية تترك انطباعًا', desc: 'نعزز حضورك الإلكتروني من خلال عناصر الثقة مثل الشهادات، التوصيات، وآراء العملاء، مما يدعم صورتك المهنية أمام جمهورك' }
        ]
      },
      fourthSection: {
        title: 'خطوات أساسية لتصميم موقع إلكتروني ناجح',
        data: [
          { id: 1, title: 'تحديد متطلبات المشروع', desc: 'جمع المتطلبات الوظيفية وغير الوظيفية.', color: 'color-1' },
          { id: 2, title: 'اختيار التكنولوجيا المناسبة', desc: 'اختيار تقنيات التطوير (HTML، CSS، JavaScript، وأطر العمل مثل React أو Angular أو Vue).', color: 'color-2' },
          { id: 3, title: 'تصميم بنية قاعدة البيانات', desc: 'اختيار نوع قاعدة البيانات (SQL أو NoSQL) وتصميم الجداول والعلاقات', color: 'color-3' },
          { id: 4, title: 'تطوير الهيكل الأساسي (Backend)', desc: 'تطوير واجهات برمجة التطبيقات (APIs) والتأكد من أداء وأمان العمليات الأساسية', color: 'color-1' },
          { id: 5, title: 'تصميم وتطوير الواجهة الأمامية (Frontend)', desc: 'استخدام HTML و CSS و JavaScript لتطوير واجهة المستخدم وربطها بالهيكل الأساسي', color: 'color-2' },
          { id: 6, title: 'الاختبار والتحقق', desc: 'إجراء اختبارات شاملة باستخدام أدوات الاختبار الآلي واختبار الوحدات', color: 'color-3' },
          { id: 7, title: 'تحسين الأداء', desc: 'تحليل الأداء باستخدام أدوات مثل Google Lighthouse وتحسين وقت التحميل والاستجابة.', color: 'color-1' },
          { id: 8, title: 'الأمان', desc: 'تأمين الموقع ضد التهديدات الشائعة واستخدام HTTPS وتشفير البيانات', color: 'color-2' },
          { id: 9, title: 'الإطلاق والنشر', desc: 'نشر الموقع على خادم الإنتاج وضمان إعداد النسخ الاحتياطي والاستعادة.', color: 'color-3' },
          { id: 10, title: 'المراقبة والصيانة', desc: 'مراقبة أداء الموقع واستقراره وتحديثه بانتظام لضمان الاستمرارية والتحسين.', color: 'color-1' }
        ]
      }
    },
    {
      id: 2,
      pageData: {
        breadCrumb: [
          { id: 0, name: 'الرئيسية ', routing: '/home' },
          { id: 1, name: 'خدماتنا ', routing: '/our-services' },
          { id: 2, name: ' تصميم تطبيقات الجوال ' }
        ],
        title: 'من فكرة إلى تطبيق يُحدث فرقًا',
        desc: 'تطبيقات جوال تُطلق مشروعك إلى مستوى جديد'
      },
      firstSection: {
        title: 'ابتكار بصري يخلق تأثيرًا لا يُنسى',
        desc: 'نحوّل رؤيتك إلى تصميم متميز يجذب الانتباه، ويعبّر بدقة عن هوية علامتك',
        img: 'assets/images/Group 1171278441.svg'
      },
      secondSection: {
        title: 'لماذا تصميم تطبيقات الجوال لدينا هو خيارك الذكي؟',
        data: [
          { title: 'استضافة موثوقة وآمنة', desc: 'نوفر بيئة استضافة حديثة وسريعة، مؤمنة بأعلى معايير الأمان' },
          { title: 'تصميم جذاب وسهل ', desc: 'نصمم واجهات احترافية تعكس علامتك وتوفر تجربة استخدام سلسة' },
          { title: ' دعم فني مستمر', desc: 'دعم متواصل على مدار الساعة لحل أي مشكلة بسرعة وكفاءة' },
          { title: ' تطوير دائم ومتجدد', desc: 'نحدث تطبيقك باستمرار ليتماشى مع أحدث تقنيات السوق' }
        ]
      },
      fourthSection: {
        title: 'خطوات بناء تطبيق يحقق نتائج حقيقية',
        data: [
          { id: 1, title: 'مرحلة التخطيط', desc: 'تحديد أهداف التطبيق، وفهم الفئة المستهدفة، لضمان تقديم تجربة تلبي احتياجاتهم بدقة.', color: 'color-1' },
          { id: 2, title: 'تصميم الواجهة', desc: 'تحويل الأفكار إلى تصميم بصري أنيق يعكس الهوية ويضمن تجربة استخدام مريحة', color: 'color-2' },
          { id: 3, title: 'المخططات الهيكلية (Wireframe)', desc: 'إنشاء تصور مبدئي لهيكل التطبيق يوضح ترتيب الشاشات وسهولة التنقل', color: 'color-3' }
        ]
      }
    },
    {
      id: 3,
      pageData: {
        breadCrumb: [
          { id: 0, name: 'الرئيسية ', routing: '/home' },
          { id: 1, name: 'خدماتنا ', routing: '/our-services' },
          { id: 2, name: 'الخادم الخاص' }
        ],
        title: 'ثقة، أمان، سرعة — في كل نقرة',
        desc: 'جاهزية دائمة، سرعة استجابة، وأمان بدون حدود'
      },
      firstSection: {
        title: 'خادمك الخاص، أداء يواكب طموحاتك',
        desc: 'نصمم حضورك الرقمي بتجربة بصرية تعكس علامتك، وتحوّل كل زيارة إلى انطباع دائم.',
        img: 'assets/images/Group 1171278442.svg'
      },
      secondSection: {
        title: 'مميزات الخادم الخاص من YOU',
        data: [
          { title: 'أداء عالي السرعة', desc: 'تشغيل سريع وسلس بفضل معالجات قوية وموارد مخصصة.' },
          { title: ' حماية بيانات قوية', desc: 'أنظمة تخزين مؤمّنة لضمان أمان واسترجاع بياناتك بسهولة.' },
          { title: 'تخصيص كامل', desc: 'حرية في اختيار إعداداتك: من النظام وحتى التطبيقات والموارد.' },
          { title: 'دعم فني دائم', desc: 'فريق دعم متخصص متاح 24/7 لحل أي مشكلة بسرعة وكفاءة.' }
        ]
      },
      thirdSection: {
        img: 'assets/images/Frame 2147225349 copy.svg',
        title: ' لماذا YOU هي خيارك الأمثل لخادم خاص؟',
        data: [
          { title: 'أداء لا يُضاهى', desc: 'استفد من موارد مخصصة بالكامل تمنحك سرعة وثبات عاليين دون مشاركة.' },
          { title: ' أمان مطلق', desc: 'تحكم كامل في إعدادات الحماية والتشفير، لضمان حماية بياناتك' },
          { title: ' تخصيص حسب الطلب', desc: 'اضبط الخادم كما تريد، واختر نظام التشغيل والتطبيقات التي تناسبك.' },
          { title: 'دعم تقني 24/7', desc: 'فريق مختص يساندك في أي وقت لضمان استمرارية أعمالك بأعلى كفاءة.' }
        ]
      }
    },
    {
      id: 4,
      pageData: {
        breadCrumb: [
          { id: 0, name: 'الرئيسية ', routing: '/home' },
          { id: 1, name: 'خدماتنا ', routing: '/our-services' },
          { id: 2, name: 'إستضافة الويب' }
        ],
        title: 'ثقة، أمان، سرعة — في كل نقرة',
        desc: 'جاهزية دائمة، سرعة استجابة، وأمان بدون حدود'
      },
      firstSection: {
        title: 'استضافة ثابتة وسريعة تتقدّم محتواك',
        desc: 'نبني حضورك الرقمي بتصميم يعكس هويتك، ويترك أثرًا لا يُنسى في كل زيارة',
        img: 'assets/images/Group 1171278442 copy.svg'
      },
      secondSection: {
        title: 'لماذا استضافتنا هي البنية الذكية لموقعك؟',
        data: [
          { title: 'أمان يُعتمد عليه', desc: 'نوفّر حماية قوية تشمل التشفير والمراقبة المستمرة لحماية بياناتك.' },
          { title: 'أداء سريع ومستقر', desc: 'خوادم قوية تضمن تحميل سريع واستقرار دائم لموقعك' },
          { title: 'مرونة حسب احتياجك', desc: 'خطط قابلة للتعديل حسب نمو مشروعك دون تعقيد' },
          { title: 'دعم فني متواصل', desc: 'فريق جاهز دائمًا لحل مشاكلك بسرعة واحترافية' }
        ]
      },
      fourthSection: {
        title: 'استضافة الويب ببساطة: كيف تعمل؟',
        data: [
          { id: 1, title: 'بنية سحابية موثوقة', desc: 'تعتمد استضافتنا على مراكز بيانات عالمية مدارة بتقنيات الحوسبة السحابية، ما يضمن أداء عالي وتخزين آمن للبيانات والملفات', color: 'color-1' },
          { id: 2, title: 'تسجيل النطاق', desc: 'نبدأ بتسجيل اسم النطاق الخاص بك، ليكون عنوانك الرقمي الذي يشير مباشرة إلى موقعك المستضاف لدينا.', color: 'color-2' },
          { id: 3, title: 'تخصيص الموارد', desc: 'نوفر لك موارد الخادم المناسبة من مساحة تخزين، وRAM، ومعالجة، بما يتماشى مع حجم موقعك واحتياجاته.', color: 'color-3' },
          { id: 4, title: 'رفع ملفات الموقع', desc: 'يتم تحميل ملفات موقعك بسهولة عبر لوحة التحكم أو بروتوكول FTP، ليبدأ الموقع في العمل على الإنترنت.', color: 'color-1' },
          { id: 5, title: 'إعداد قواعد البيانات', desc: 'ننظم قواعد بيانات قوية (مثل MySQL) لاحتواء بيانات موقعك وتسهيل التفاعل معها بسرعة وأمان.', color: 'color-2' },
          { id: 6, title: 'تهيئة الخادم', desc: 'نضبط الخادم ليخدم موقعك بكفاءة، باستخدام برامج مثل Apache أو Nginx لضمان سرعة الاستجابة واستقرار الأداء.', color: 'color-3' },
          { id: 7, title: 'نشر الموقع وظهوره للزوار', desc: 'بعد الإعداد، يصبح موقعك متاحًا عبر الإنترنت ويستجيب بسرعة لأي طلب من المتصفح باستخدام النطاق الخاص بك.', color: 'color-1' },
          { id: 8, title: 'إدارة دورية وصيانة', desc: 'نوفر تحديثات منتظمة، نسخ احتياطية، وحلول سريعة لأي مشكلة، لتضمن أداء مستمر بدون انقطاع.', color: 'color-2' }
        ]
      }
    },
    {
      id: 5,
      pageData: {
        breadCrumb: [
          { id: 0, name: 'الرئيسية ', routing: '/home' },
          { id: 1, name: 'خدماتنا ', routing: '/our-services' },
          { id: 2, name: 'إدارة السيرفرات ' }
        ],
        title: 'تحكّم كامل. أداء بلا حدود',
        desc: 'ندير خوادمك بكفاءة عالية، لضمان استقرار أعمالك وأمان بياناتك في كل لحظة تشغيل'
      },
      firstSection: {
        title: 'تحكم كامل. أمان أعلى. دعم لا يتوقف',
        desc: 'ندير بنيتك التحتية الرقمية بكفاءة تامة، لنمنحك استقرارًا دائمًا، وأداءً يعزز ثقة عملائك في كل لحظة اتصال.',
        img: 'assets/images/Group 1171278442 copy 2.svg'
      },
      secondSection: {
        title: 'من أجل تشغيل بلا أعطال... اختر إدارة السيرفرات من YOU',
        data: [
          { title: 'استجابة أفضل', desc: 'نساعدك في تحسين استجابة موقعك للمستخدمين، مما يزيد من رضاهم ووفائهم' },
          { title: 'تحسين الجودة', desc: 'نعمل بأفضل طرق الاختبار وضمان الجودة لضمان توفير تطبيقات خالية من الأخطاء.' },
          { title: 'الأمان المتقدم', desc: 'نحرص على حماية بياناتك وتطبيقاتك من التهديدات و الاختراقات' },
          { title: 'دعم مستدام', desc: 'نحن هنا دائما لمساعدتك على مدار الساعة للتعامل مع أي مشكلة أو استفسار.' }
        ]
      },
      thirdSection: {
        img: 'assets/images/you-frame.svg',
        title: 'لماذا YOU هي شريكك الأمثل لإدارة السيرفرات؟',
        data: [
          { title: 'تعزيز سرعة التطوير', desc: 'خدمتنا تمكنك من تقليص الوقت اللازم لتطوير ونشر تطبيقاتك بشكل كبير، حيث تدمج بين التطوير والعمليات لضمان استجابة سريعة وفعالة.' },
          { title: 'زيادة الاستقرار', desc: 'باستخدام استراتيجيات DevOps، نعمل على تحسين استقرار تطبيقاتك وتقليل الأعطال والمشاكل التقنية، مما ينتج عنه أداء أكثر ثباتًا وموثوقية.' },
          { title: 'أمان معزز', desc: 'نحرص على توفير مستوى عالٍ من الأمان لتطبيقاتك وبياناتك من خلال تطبيق أفضل الممارسات الأمنية الحديثة والمتطورة.' },
          { title: 'تكامل فعال', desc: 'خدمتنا تسمح بدمج سهل وفعال لمختلف الأدوات والتقنيات، بما في ذلك التطبيقات، قواعد البيانات، وأنظمة الإدارة، ' }
        ]
      },
      fourthSection: {
        title: '',
        data: [
          { id: 1, title: 'التخطيط', desc: 'نبدأ بتحليل متطلبات مشروعك ونضع خطة تطوير شاملة تضمن تحقيق الأهداف المرجوة بكفاءة.', color: 'color-1' },
          { id: 2, title: 'التطوير', desc: 'تقوم فرق البرمجة المتخصصة لدينا ببناء التطبيقات والبرمجيات باستخدام أحدث الأدوات والتقنيات المتقدمة لتحقيق أفضل النتائج.', color: 'color-2' },
          { id: 3, title: 'الاختبار', desc: 'ختبر التطبيقات بعناية فائقة لضمان عدم وجود أي عيوب و لتوفير أعلى مستويات الجودة والأمان.', color: 'color-3' },
          { id: 4, title: 'النشر', desc: 'بعد الاختبار، نقوم بنشر التطبيقات في بيئات الإنتاج بطريقة آمنة وموثوقة لضمان التشغيل السلس.', color: 'color-1' },
          { id: 5, title: 'المراقبة', desc: 'نستمر في مراقبة أداء التطبيقات لاكتشاف أي مشاكل أو أخطاء بشكل فوري وتقديم الدعم اللازم لضمان استمرارية العمل.', color: 'color-2' }
        ]
      }
    },
    {
      id: 6,
      pageData: {
        breadCrumb: [
          { id: 0, name: 'الرئيسية ', routing: '/home' },
          { id: 1, name: 'خدماتنا ', routing: '/our-services' },
          { id: 2, name: 'التسويق الإلكتروني' }
        ],
        title: 'ننقلك من الظهور إلى التأثير',
        desc: 'نُخطط، نُنفذ، ونُحلل لتحقيق نتائج ملموسة، ونبني لك حضورًا رقميًا يحقق النمو ويزيد من ولاء العملاء.'
      },
      firstSection: {
        title: 'نرتقي بعلامتك الرقمية بخطى واثقة وأثر باقٍ',
        desc: 'نصمم حملاتك الرقمية بذوق رفيع، لنمنح علامتك الحضور الأنيق، والوصول المدروس الذي يترك أثرًا طويل المدى',
        img: 'assets/images/Group 1171278442 copy 3.svg'
      },
      secondSection: {
        title: 'نحو جمهورك، بخطى محسوبة',
        data: [
          { title: 'وصول موجه بدقة', desc: 'نوصّل رسالتك بدقة لجمهورك المثالي لتحقيق أعلى عائد.' },
          { title: 'تحليلات دقيقة', desc: 'نراقب الأداء لحظة بلحظة لاتخاذ قرارات مدروسة.' },
          { title: 'محتوى يعبر عنك', desc: 'ننشئ محتوى يعكس هوية علامتك ويحفز التفاعل' },
          { title: ' استراتيجيات مرنة', desc: 'نطوّر خططًا تتكيّف مع السوق وتدعم نموك المستمر.' }
        ]
      },
      thirdSection: {
        img: 'assets/images/Frame 2147225349 copy 2.svg',
        title: 'لماذا YOU هي شريكك الأمثل في التسويق الإلكتروني؟',
        data: [
          { title: 'خبرة ممتدة', desc: 'نمتلك سنوات من الخبرة العملية في التسويق الرقمي والتجارة الإلكترونية، ونقدم حلولًا دقيقة تلبي احتياجاتك وتحقق أهدافك' },
          { title: 'خدمات متكاملة', desc: 'من تحسين محركات البحث، والإعلانات الممولة، إلى التسويق عبر السوشيال ميديا وكتابة المحتوى—كلها تحت سقف واحد' },
          { title: 'استراتيجيات مصممة لك', desc: 'نفهم خصوصية كل نشاط تجاري، ونبني استراتيجيات مخصصة تعبر عن هويتك وتستهدف جمهورك بكفاءة' },
          { title: 'تقنيات حديثة', desc: 'نستخدم أدوات تسويقية متقدمة لتحسين أداء الحملات وضمان أفضل النتائج' }
        ]
      }
    },
    {
      id: 7,
      pageData: {
        breadCrumb: [
          { id: 0, name: 'الرئيسية ', routing: '/home' },
          { id: 1, name: 'خدماتنا ', routing: '/our-services' },
          { id: 2, name: 'خدمات التصميم ' }
        ],
        title: 'ننقلك من الظهور إلى التأثير',
        desc: 'نصمّم رؤيتك... ونُحَوِّل الأفكار إلى تجربة بصرية لا تُنسى'
      },
      firstSection: {
        title: 'نصمّم لهويتك حضورًا بصريًا يُلهم ويترك بصمة ',
        desc: 'نبتكر هويتك البصرية بذوق مدروس، لنمنح علامتك حضورًا مميزًا، وتأثيرًا بصريًا يُترجم رؤيتك بوضوح وإبداع',
        img: 'assets/images/Group 1171278442 copy 4.svg'
      },
      secondSection: {
        title: 'مميزات خدمة التصميم من YOU',
        data: [
          { title: 'تصاميم عصرية تلائم جمهورك', desc: 'نواكب أحدث الاتجاهات لنبرز علامتك بشكل ملفت.' },
          { title: 'هوية بصرية متكاملة', desc: 'نصمم كل عنصر ليعبر بدقة عن روح علامتك.' },
          { title: 'مرونة في التخصيص', desc: 'نقدّم تصاميم قابلة للتعديل لتناسب احتياجاتك.' },
          { title: 'جودة عالية', desc: 'نضمن تنفيذ احترافي ودقة في كل تفصيلة.' }
        ]
      },
      thirdSection: {
        img: 'assets/images/Frame 2147225349 copy 3.svg',
        title: 'لماذا YOU هي خيارك الأمثل في خدمات التصميم؟',
        data: [
          { title: 'الخبرة والاحترافية', desc: 'لدينا فريق من المصممين المحترفين الذين يجمعون بين الخبرة و عشقهم لما يفعلون، ما يترجم إلى تصميمات تلفت الأنظار وتدوم طويلًا.' },
          { title: 'التكنولوجيا الحديثة', desc: 'استخدامنا لأحدث التقنيات يضمن لك الحصول على تصميمات تتميز بالتجدد والكفاءة، وتسبق الاتجاهات الحديثة في عالم التصميم.' },
          { title: 'التحليل والتقييم المستمر', desc: 'نلتزم بمراجعة وتحسين تصميماتنا باستمرار لضمان تحقيق أفضل النتائج.' },
          { title: 'سجل حافل بالنجاح', desc: 'نفتخر بتاريخنا المليء بالنجاحات والإنجازات مع عملائنا، مما يجعلنا شريكك الموثوق لكل تحديات التصميم.' }
        ]
      }
    }
  ];

  getObjectById(id: any): Observable<any> {
    const result = this.mainObject.find(obj => obj.id == id);
    return of(result);
  }
}
